-- phpMyAdmin SQL Dump
-- version 4.9.0.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Jun 02, 2020 at 06:51 PM
-- Server version: 10.4.6-MariaDB
-- PHP Version: 7.1.32

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `systemfx`
--

-- --------------------------------------------------------

--
-- Table structure for table `login`
--

CREATE TABLE `login` (
  `ID` varchar(225) NOT NULL,
  `name` varchar(225) NOT NULL,
  `Grade` varchar(225) NOT NULL,
  `password` int(11) NOT NULL,
  `KeyValue` int(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `login`
--

INSERT INTO `login` (`ID`, `name`, `Grade`, `password`, `KeyValue`) VALUES
('U10616001', 'A同學', '資科系三', 101, 0),
('U10616002', 'B同學', '資科系三', 202, 0),
('U10616003', 'C同學', '資科系三', 303, 0),
('U10616004', 'D同學', '資科系三', 404, 0),
('U10616005', 'E同學', '資科系三', 505, 0),
('U10616006', 'F同學', '資科系三', 606, 0),
('U10616007', 'G同學', '資科系三', 707, 0),
('U10616008', 'H同學', '資科系三', 808, 0),
('U10616009', 'I同學', '資科系三', 909, 0),
('U10616010', 'J同學', '資科系三', 1010, 0),
('U10616011', 'K同學', '資科系三', 1111, 0),
('A10016001', '梁世聰 教授', '資科系', 101, 1),
('A10016002', '陳彥宏 教授', '資科系', 202, 1),
('A10016003', '賴阿福 教授', '資科系', 303, 1),
('A10016004', '盧東華 教授', '資科系', 404, 1),
('A10016005', '洪瑞鍾 教授', '資科系', 505, 1),
('A10016006', '壽大衛 教授', '資科系', 606, 1),
('A10016007', '黃志鵬 教授', '資科系', 707, 1),
('A10016008', '李坤翰 教授', '資科系', 808, 1),
('A10016009', '蔡俊明 教授', '資科系', 909, 1),
('M11122100', 'Manager1', '管理員', 100100, 2),
('M11122101', 'Manager2', '管理員', 101101, 2),
('﻿U10616012', 'L同學', '資科系三', 1212, 0),
('U10616013', 'M同學', '資科系三', 1313, 0),
('U10616014', 'N同學', '資科系三', 1414, 0),
('U10616015', 'O同學', '資科系三', 1515, 0),
('U10616016', 'P同學', '資科系三', 1616, 0),
('U10616017', 'L同學', '資科系三', 1717, 0),
('U10616018', 'M同學', '資科系三', 1818, 0),
('U10616019', 'N同學', '資科系三', 1919, 0),
('U10616020', 'O同學', '資科系三', 2020, 0),
('U10616021', 'P同學', '資科系三', 2121, 0),
('U10616022', 'L同學', '資科系三', 2222, 0),
('U10616023', 'M同學', '資科系三', 2323, 0),
('U10616024', 'N同學', '資科系三', 2424, 0),
('U10616025', 'L同學', '資科系三', 2525, 0),
('U10616026', 'M同學', '資科系三', 2626, 0),
('U10616027', 'N同學', '資科系三', 2727, 0),
('U10616028', 'O同學', '資科系三', 2828, 0),
('U10616029', 'P同學', '資科系三', 2929, 0),
('U10616030', 'L同學', '資科系三', 3030, 0),
('U10616031', 'L同學', '資科系三', 3131, 0),
('U10616032', 'M同學', '資科系三', 3232, 0),
('U10616033', 'N同學', '資科系三', 3333, 0),
('U10616034', 'O同學', '資科系三', 3434, 0),
('U10616035', 'P同學', '資科系三', 3535, 0),
('U10616036', 'L同學', '資科系三', 3636, 0),
('U10616037', 'M同學', '資科系三', 3737, 0),
('U10616038', 'N同學', '資科系三', 3838, 0),
('U10616039', 'O同學', '資科系三', 3939, 0),
('U10616040', 'P同學', '資科系三', 4040, 0),
('U10616041', 'L同學', '資科系三', 4141, 0),
('U10616042', 'M同學', '資科系三', 4242, 0),
('U10616043', 'N同學', '資科系三', 4343, 0),
('U10616044', 'L同學', '資科系三', 4444, 0),
('U10616045', 'M同學', '資科系三', 4545, 0),
('A10016010', '楊政穎 教授', '資科系', 1010, 1);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
